; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-6-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-0 - location
	p1-3 - location
	p1-5 - location
	p2-0 - location
	p2-4 - location
	p3-0 - location
	p3-2 - location
	p4-0 - location
	p4-1 - location
	p5-3 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s0)
	(at driver5 s3)
	(at driver6 s2)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at package1 s5)
	(at package2 s1)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s4)
	(link s4 s1)
	(link s2 s1)
	(link s1 s2)
	(link s3 s4)
	(link s4 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s2)
	(link s2 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s2)
	(link s2 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s0)
	(at driver5 s0)
	(at driver6 s1)
	(at truck2 s3)
	(at truck3 s1)
	(at truck4 s1)
	(at truck5 s0)
	(at truck6 s4)
	(at package1 s1)
	(at package2 s2)
	))


)

; plan
1. (board-truck driver4 s0 truck2)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 1 of 11
2. (board-truck driver1 s4 truck3)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 0 of 11
3. (disembark-truck driver4 s0 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 0 of 11
4. (board-truck driver6 s2 truck5)
   deleted: (at driver6 s2) (empty truck5)
   added: (driving driver6 truck5)
   goals met: 0 of 11
5. (drive-truck driver1 s4 s1 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   goals met: 1 of 11
6. (load-truck s1 package2 truck3)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   goals met: 1 of 11
7. (drive-truck driver6 s2 s0 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   goals met: 2 of 11
8. (walk driver2 s3 p3-0)
   deleted: (at driver2 s3)
   added: (at driver2 p3-0)
   goals met: 2 of 11
9. (walk driver2 p3-0 s0)
   deleted: (at driver2 p3-0)
   added: (at driver2 s0)
   goals met: 3 of 11
10. (board-truck driver4 s0 truck2)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 3 of 11
11. (drive-truck driver4 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 4 of 11
12. (walk driver5 s3 p3-0)
   deleted: (at driver5 s3)
   added: (at driver5 p3-0)
   goals met: 4 of 11
13. (walk driver5 p3-0 s0)
   deleted: (at driver5 p3-0)
   added: (at driver5 s0)
   goals met: 5 of 11
14. (drive-truck driver4 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 4 of 11
15. (load-truck s5 package1 truck2)
   deleted: (at package1 s5)
   added: (in package1 truck2)
   goals met: 4 of 11
16. (drive-truck driver4 s5 s1 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   goals met: 4 of 11
17. (unload-truck s1 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   goals met: 5 of 11
18. (drive-truck driver4 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 5 of 11
19. (drive-truck driver4 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 6 of 11
20. (drive-truck driver1 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 5 of 11
21. (unload-truck s2 package2 truck3)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 6 of 11
22. (drive-truck driver1 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 7 of 11
23. (disembark-truck driver1 s1 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 7 of 11
24. (walk driver1 s1 p4-1)
   deleted: (at driver1 s1)
   added: (at driver1 p4-1)
   goals met: 7 of 11
25. (walk driver1 p4-1 s4)
   deleted: (at driver1 p4-1)
   added: (at driver1 s4)
   goals met: 8 of 11
26. (disembark-truck driver6 s0 truck5)
   deleted: (driving driver6 truck5)
   added: (at driver6 s0) (empty truck5)
   goals met: 8 of 11
27. (walk driver6 s0 p1-0)
   deleted: (at driver6 s0)
   added: (at driver6 p1-0)
   goals met: 8 of 11
28. (walk driver6 p1-0 s1)
   deleted: (at driver6 p1-0)
   added: (at driver6 s1)
   goals met: 9 of 11
29. (board-truck driver5 s0 truck4)
   deleted: (at driver5 s0) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 8 of 11
30. (drive-truck driver5 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 9 of 11
31. (disembark-truck driver5 s1 truck4)
   deleted: (driving driver5 truck4)
   added: (at driver5 s1) (empty truck4)
   goals met: 9 of 11
32. (walk driver5 s1 p1-0)
   deleted: (at driver5 s1)
   added: (at driver5 p1-0)
   goals met: 9 of 11
33. (walk driver5 p1-0 s0)
   deleted: (at driver5 p1-0)
   added: (at driver5 s0)
   goals met: 10 of 11
34. (board-truck driver5 s0 truck6)
   deleted: (at driver5 s0) (empty truck6)
   added: (driving driver5 truck6)
   goals met: 9 of 11
35. (drive-truck driver5 s0 s4 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s4)
   goals met: 10 of 11
36. (disembark-truck driver5 s4 truck6)
   deleted: (driving driver5 truck6)
   added: (at driver5 s4) (empty truck6)
   goals met: 10 of 11
37. (walk driver5 s4 p4-0)
   deleted: (at driver5 s4)
   added: (at driver5 p4-0)
   goals met: 10 of 11
38. (walk driver5 p4-0 s0)
   deleted: (at driver5 p4-0)
   added: (at driver5 s0)
   goals met: 11 of 11
